In [1]:
#Session 12 : Decision Tree and Forest Tree

In [2]:
# over efficient , over fit . poor prediction

#steps of Random forest
#bootstrap = sub-sampling of data .sampling with replacement random rows and random columns
# take average results of each samples' regression

In [16]:
import pandas as pd
import numpy as np

In [39]:
df = pd.read_csv(r"C:\Users\MuhammadBilal\OneDrive - Unison\Desktop\df1.csv")

In [40]:
df

    Age  Experience  Rank Nationality Apply
0    36           3     3          UK    NO
1    34           4     5         USA    NO
2    45           5     7           N    NO
3    65           7     5         USA    NO
4    34           2     8         USA    NO
5    32           3     9         USA    NO
6    22           6     4          UK   YES
7    12           3     5           N    NO
8     3           4     6          UK    NO
9    45           3     3          UK   YES
10   35           1     2           N    NO
11   35           1     2           N    NO

In [41]:
d ={'UK':0 , 'USA':1,'N':2}
df['Nationality'] = df['Nationality'].map(d)
d = {'YES':1,'NO':0}
df['Apply'] = df['Apply'].map(d)

print(df)

    Age  Experience  Rank  Nationality  Apply
0    36           3     3            0      0
1    34           4     5            1      0
2    45           5     7            2      0
3    65           7     5            1      0
4    34           2     8            1      0
5    32           3     9            1      0
6    22           6     4            0      1
7    12           3     5            2      0
8     3           4     6            0      0
9    45           3     3            0      1
10   35           1     2            2      0
11   35           1     2            2      0

In [23]:
#Random Forest

In [42]:
features =['Age','Experience','Rank','Nationality']
 
X = df[features]
y = df['Apply']

print(X)
print(y)

    Age  Experience  Rank  Nationality
0    36           3     3            0
1    34           4     5            1
2    45           5     7            2
3    65           7     5            1
4    34           2     8            1
5    32           3     9            1
6    22           6     4            0
7    12           3     5            2
8     3           4     6            0
9    45           3     3            0
10   35           1     2            2
11   35           1     2            2
0     0
1     0
2     0
3     0
4     0
5     0
6     1
7     0
8     0
9     1
10    0
11    0
Name: Apply, dtype: int64

In [43]:
from sklearn.model_selection import train_test_split

In [44]:
X_train , X_test ,y_traain , y_test = train_test_split (X,y,test_size=0.2) # size defines test sample

In [45]:
X_train

    Age  Experience  Rank  Nationality
5    32           3     9            1
8     3           4     6            0
0    36           3     3            0
10   35           1     2            2
4    34           2     8            1
3    65           7     5            1
9    45           3     3            0
7    12           3     5            2
6    22           6     4            0

In [46]:
X_test

    Age  Experience  Rank  Nationality
11   35           1     2            2
1    34           4     5            1
2    45           5     7            2

In [47]:
y_test

11    0
1     0
2     0
Name: Apply, dtype: int64

In [48]:
y_traain

5     0
8     0
0     0
10    0
4     0
3     0
9     1
7     0
6     1
Name: Apply, dtype: int64

In [49]:
import numpy as np
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import mean_squared_error

rand_est = RandomForestClassifier()
rand_est.fit(X_train,y_traain)

y_pred = rand_est.predict(X_test)
print('The Score on the test set with a random forest classifier is:', rand_est.score(X_test,y_test))

The Score on the test set with a random forest classifier is: 1.0